app/controllers/candidates_controller.rb

  def favorites
    @candidates = Candidate.favorited_candidates(@current_user)

    if @candidates.empty?
---
SELECT  "candidates".* FROM "candidates" WHERE (4) LIMIT ?  [["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."candidate_id" = ?  [["candidate_id", 1]]

  def show
    @current_user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @candidate = Candidate.new(candidate_params)
    if @candidate.save
---
INSERT INTO "candidates" ("first_name", "last_name", "party_affiliation", "office_position", "location", "platform_outline", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @candidate.update(candidate_params)
---
UPDATE "candidates" SET "location" = ?, "updated_at" = ? WHERE "candidates"."id" = ?  [["location", "Senator from NJ"], ["updated_at", "2019-07-20 16:09:21.167628"], ["id", 2]]

  def destroy
    @candidate.destroy
---
DELETE FROM "candidates" WHERE "candidates"."id" = ?  [["id", 11]]

  def current_user
    @current_user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def find_candidate
    @candidate = Candidate.find(params[:id])
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]