app/controllers/candidates_controller.rb

  def destroy
    find_candidate.destroy
---
DELETE FROM "candidates" WHERE "candidates"."id" = ?  [["id", 3]]

  def find_candidate
    @candidate = Candidate.find(params[:id])
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]