app/controllers/candidates_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."candidate_id" = ?  [["candidate_id", 11]]
---
  def favorites
    @candidates = Candidate.favorited_candidates(@current_user)

    if @candidates.empty?