app/controllers/contributions_controller.rb

SELECT "contributions".* FROM "contributions"
---
  def index
    if params[:contributor_id]
      @contributions = Contributor.find(params[:contributor_id]).contributions
    else
      @contributions = Contribution.all

SELECT  "contributions".* FROM "contributions" WHERE "contributions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_contribution
    @contribution = Contribution.find(params[:id])