app/controllers/contributions_controller.rb

  def index
    if params[:contributor_id]
      @contributions = Contributor.find(params[:contributor_id]).contributions.all_by_date
    elsif params[:candidate_id]
      @contributions = Candidate.find(params[:candidate_id]).contributions.all_by_date
---
SELECT "contributions".* FROM "contributions" WHERE "contributions"."contributor_id" = ? ORDER BY "contributions"."date" DESC  [["contributor_id", 2]]
SELECT  "contributors".* FROM "contributors" WHERE "contributors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "contributions".* FROM "contributions" WHERE "contributions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "contributors".* FROM "contributors" WHERE "contributors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @contribution = Contribution.new(contribution_params)
    if @contribution.save
---
INSERT INTO "contributions" ("amount", "date", "created_at", "updated_at", "candidate_id", "contributor_id") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 100], ["date", "07/21/2019"], ["created_at", "2019-07-20 20:10:29.662344"], ["updated_at", "2019-07-20 20:10:29.662344"], ["candidate_id", 2], ["contributor_id", 1]]

  def update
    find_contribution
    @contribution.update(contribution_params)
---
UPDATE "contributions" SET "date" = ?, "updated_at" = ? WHERE "contributions"."id" = ?  [["date", "07/21/2019"], ["updated_at", "2019-07-22 03:22:16.437755"], ["id", 13]]

  def destroy
    find_contribution.destroy
---
DELETE FROM "contributions" WHERE "contributions"."id" = ?  [["id", 3]]

  def find_contribution
    @contribution = Contribution.find(params[:id])
---
SELECT  "contributions".* FROM "contributions" WHERE "contributions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]