app/controllers/contributions_controller.rb

  def index
    if params[:contributor_id]
      @contributions = Contributor.find(params[:contributor_id]).contributions.all_by_date
    elsif params[:candidate_id]
      @contributions = Candidate.find(params[:candidate_id]).contributions.all_by_date
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "contributors".* FROM "contributors" WHERE "contributors"."id" IS NULL LIMIT ?  [["LIMIT", 1]]