app/controllers/contributors_controller.rb

SELECT "contributors".* FROM "contributors"
---
  def index
    @contributors = Contributor.all

INSERT INTO "contributors" ("name", "industry_affiliation", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "SuperDuperPAC"], ["industry_affiliation", "Ideology/Single-Issue"], ["created_at", "2019-07-20 16:24:22.866269"], ["updated_at", "2019-07-20 16:24:22.866269"]]
---
  def create
    @contributor = Contributor.new(contributor_params)
    if @contributor.save

UPDATE "contributors" SET "industry_affiliation" = ?, "updated_at" = ? WHERE "contributors"."id" = ?  [["industry_affiliation", ""], ["updated_at", "2019-07-19 23:28:41.764846"], ["id", 1]]
---
  def update
    find_contributor
    @contributor.update(contributor_params)

DELETE FROM "contributors" WHERE "contributors"."id" = ?  [["id", 1]]
---
  def destroy
    find_contributor.destroy

SELECT  "contributors".* FROM "contributors" WHERE "contributors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_contributor
    @contributor = Contributor.find(params[:id])