app/controllers/sessions_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "uid", "image") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "2910548335628368"], ["LIMIT", 1]]
---
  def fb_create
    @user = User.find_or_create_by(uid: auth['uid']) do |u|