app/models/candidate.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 1]]
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def self.favorited_candidates(current_user)
    @current_user = current_user
    @candidates = []

    @current_user.favorites.each do |fav|
      @candidates << Candidate.find_by(id: fav.candidate_id)