app/models/contribution.rb

  def contributor_name=(contributor_name)
    self.contributor = Contributor.find_or_create_by(name: contributor_name)
---
SELECT  "contributors".* FROM "contributors" WHERE "contributors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]