app/models/contribution.rb

  def candidate_name=(candidate_name)
    if !candidate_name.nil? && candidate_name != ""
      first_name = candidate_name.split(" ")[0]
      last_name = candidate_name.split(" ")[1]
      self.candidate = Candidate.find_or_create_by(first_name: first_name, last_name: last_name)
---
INSERT INTO "candidates" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Joseph"], ["last_name", "\"Joe\""], ["created_at", "2019-07-21 18:25:33.704392"], ["updated_at", "2019-07-21 18:25:33.704392"]]
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."first_name" = ? AND "candidates"."last_name" = ? LIMIT ?  [["first_name", "Bernie"], ["last_name", "Sanders"], ["LIMIT", 1]]

  def candidate_name
    self.candidate ? (self.candidate.first_name + " " + self.candidate.last_name) : nil
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def contributor_name=(contributor_name)
    self.contributor = Contributor.find_or_create_by(name: contributor_name)
---
INSERT INTO "contributors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Bros"], ["created_at", "2019-07-21 18:23:11.201902"], ["updated_at", "2019-07-21 18:23:11.201902"]]
SELECT  "contributors".* FROM "contributors" WHERE "contributors"."name" = ? LIMIT ?  [["name", "Bros"], ["LIMIT", 1]]