app/models/user.rb

INSERT INTO "favorites" ("user_id", "candidate_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["candidate_id", 1], ["created_at", "2019-07-25 16:23:48.587121"], ["updated_at", "2019-07-25 16:23:48.587121"]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."candidate_id" = ? LIMIT ?  [["user_id", 1], ["candidate_id", 1], ["LIMIT", 1]]
---
  def favorite(candidate)
    self.favorites.find_or_create_by(candidate: candidate)

DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."candidate_id" = ?  [["user_id", 1], ["candidate_id", 1]]
---
  def unfavorite(candidate)
    self.favorites.where(candidate: candidate).destroy_all

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."candidate_id" = ? LIMIT ?  [["user_id", 1], ["candidate_id", 1], ["LIMIT", 1]]
---
  def favorited?(candidate)
    self.favorites.find_by(candidate_id: candidate.id).present?