app/views/contributors/show.html.erb

  <p>Candidates Contributed To:
    <% @contributor.candidates.each do |c| %>
---
SELECT "candidates".* FROM "candidates" INNER JOIN "contributions" ON "candidates"."id" = "contributions"."candidate_id" WHERE "contributions"."contributor_id" = ?  [["contributor_id", 1]]